socialNetwork/results/benchmark1.5b-replica-scale-09-09-26_173920/scale-16x/st5-AttUpd/800.txt
Running 2m test @ http://155.98.38.240:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 60.030ms, rate sampling interval: 179ms
  Thread calibration: mean lat.: 62.272ms, rate sampling interval: 199ms
  Thread calibration: mean lat.: 58.286ms, rate sampling interval: 175ms
  Thread calibration: mean lat.: 55.634ms, rate sampling interval: 162ms
  Thread calibration: mean lat.: 58.012ms, rate sampling interval: 179ms
  Thread calibration: mean lat.: 61.130ms, rate sampling interval: 193ms
  Thread calibration: mean lat.: 57.144ms, rate sampling interval: 171ms
  Thread calibration: mean lat.: 57.807ms, rate sampling interval: 170ms
  Thread calibration: mean lat.: 60.487ms, rate sampling interval: 182ms
  Thread calibration: mean lat.: 56.292ms, rate sampling interval: 161ms
  Thread calibration: mean lat.: 60.843ms, rate sampling interval: 183ms
  Thread calibration: mean lat.: 60.745ms, rate sampling interval: 187ms
  Thread calibration: mean lat.: 59.596ms, rate sampling interval: 189ms
  Thread calibration: mean lat.: 60.651ms, rate sampling interval: 189ms
  Thread calibration: mean lat.: 60.073ms, rate sampling interval: 194ms
  Thread calibration: mean lat.: 62.043ms, rate sampling interval: 202ms

-----------------------------------------------------------------------
Test Results @ http://155.98.38.240:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    57.56ms   24.83ms 147.46ms   79.58%
    Req/Sec    49.73     16.03    89.00     69.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   51.65ms
 75.000%   65.41ms
 90.000%   89.28ms
 99.000%  147.46ms
 99.900%  212.35ms
 99.990%  292.10ms
 99.999%  328.96ms
100.000%  350.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.975     0.000000            1         1.00
      34.335     0.100000         8865         1.11
      39.519     0.200000        17642         1.25
      43.839     0.300000        26479         1.43
      47.711     0.400000        35251         1.67
      51.647     0.500000        44059         2.00
      53.791     0.550000        48502         2.22
      56.031     0.600000        52891         2.50
      58.591     0.650000        57275         2.86
      61.567     0.700000        61703         3.33
      65.407     0.750000        66087         4.00
      67.711     0.775000        68292         4.44
      70.463     0.800000        70499         5.00
      73.919     0.825000        72686         5.71
      78.079     0.850000        74894         6.67
      83.071     0.875000        77094         8.00
      85.887     0.887500        78186         8.89
      89.279     0.900000        79285        10.00
      92.735     0.912500        80385        11.43
      96.767     0.925000        81489        13.33
     101.311     0.937500        82592        16.00
     103.999     0.943750        83149        17.78
     107.071     0.950000        83691        20.00
     110.463     0.956250        84245        22.86
     114.431     0.962500        84801        26.67
     118.783     0.968750        85343        32.00
     121.215     0.971875        85615        35.56
     124.287     0.975000        85895        40.00
     127.551     0.978125        86167        45.71
     131.711     0.981250        86442        53.33
     136.447     0.984375        86716        64.00
     139.263     0.985938        86855        71.11
     142.079     0.987500        86993        80.00
     145.407     0.989062        87133        91.43
     149.119     0.990625        87269       106.67
     153.215     0.992188        87404       128.00
     155.647     0.992969        87473       142.22
     159.103     0.993750        87542       160.00
     162.303     0.994531        87614       182.86
     166.143     0.995313        87680       213.33
     172.031     0.996094        87748       256.00
     174.335     0.996484        87785       284.44
     177.279     0.996875        87817       320.00
     182.143     0.997266        87854       365.71
     185.087     0.997656        87887       426.67
     189.951     0.998047        87920       512.00
     193.919     0.998242        87939       568.89
     197.375     0.998437        87955       640.00
     201.983     0.998633        87973       731.43
     209.151     0.998828        87989       853.33
     213.247     0.999023        88006      1024.00
     216.447     0.999121        88015      1137.78
     220.287     0.999219        88025      1280.00
     222.207     0.999316        88032      1462.86
     228.735     0.999414        88042      1706.67
     233.087     0.999512        88049      2048.00
     236.927     0.999561        88054      2275.56
     239.743     0.999609        88058      2560.00
     241.407     0.999658        88062      2925.71
     247.423     0.999707        88067      3413.33
     249.855     0.999756        88071      4096.00
     254.719     0.999780        88073      4551.11
     262.911     0.999805        88075      5120.00
     271.359     0.999829        88078      5851.43
     280.063     0.999854        88080      6826.67
     291.583     0.999878        88082      8192.00
     292.095     0.999890        88083      9102.22
     295.423     0.999902        88084     10240.00
     296.959     0.999915        88085     11702.86
     298.751     0.999927        88086     13653.33
     299.519     0.999939        88087     16384.00
     305.663     0.999945        88088     18204.44
     305.663     0.999951        88088     20480.00
     306.687     0.999957        88089     23405.71
     306.687     0.999963        88089     27306.67
     328.191     0.999969        88090     32768.00
     328.191     0.999973        88090     36408.89
     328.191     0.999976        88090     40960.00
     328.959     0.999979        88091     46811.43
     328.959     0.999982        88091     54613.33
     328.959     0.999985        88091     65536.00
     328.959     0.999986        88091     72817.78
     328.959     0.999988        88091     81920.00
     350.719     0.999989        88092     93622.86
     350.719     1.000000        88092          inf
#[Mean    =       57.559, StdDeviation   =       24.833]
#[Max     =      350.464, Total count    =        88092]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  95968 requests in 2.00m, 1.19GB read
  Non-2xx or 3xx responses: 2
Requests/sec:    799.90  
Transfer/sec:     10.19MB